package com.example.bhagi.enjoy;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.widget.Button;
import android.widget.ListView;
import android.text.method.ScrollingMovementMethod;
import android.widget.TextView;
import java.util.ArrayList;
import static com.example.bhagi.enjoy.MotivationActivity.story;

public class HistoryActivity extends AppCompatActivity {
    Button btn;
    TextView txtView;
    public static String [] story={"मोहन जोदड़ो का इतिहास-\n" +"मुअनजो-दड़ो का सिन्धी भाषा में अर्थ है \" मुर्दों का टीला \"। यह दुनिया का सबसे पुराना नियोजित और उत्कृष्ट शहर माना जाता है। यह सिंघु घाटी सभ्यता का सबसे परिपक्व शहर है। यह नगर अवशेष सिन्धु नदी के किनारे सक्खर ज़िले में स्थित है। मोहन जोदड़ो शब्द का सही उच्चारण है 'मुअन जो दड़ो'। इसकी खोज राखालदास बनर्जी ने 1922 ई. मे की। भारतीय पुरातत्व सर्वेक्षण के महानिदेशक जान मार्शल के निर्देश पर खुदाई का कार्य शुरु हुआ। यहाँ पर खुदाई के समय बड़ी मात्रा मे ईमारतें, धातुओं की मूर्तियाँ, और मुहरें आदि मिले। पिछले 100 वर्षों में अब तक इस शहर के एक-तिहाई भाग की ही खुदाई हो सकी है, और अब वह भी बंद हो चुकी है। माना जाता है कि यह शहर 200 हेक्टेयर क्षेत्र में फैला था।\n"+
            " मोहन जोदड़ो की बातें इतिहास के पन्नों में बहुत ही मशहूर है। मोहन जोदड़ो  प्राचीन सिंधु घाटी का रहस्यामी महानगर है जो की अभी दक्षिणी एशिया के सिन्धु नदी के पश्चिम में लरकाना डिस्टिक, पाकिस्तान में मौजूद है। मोहन जोदड़ो का अर्थ है “मुर्दों का टीला”। यह मनुष्य द्वारा निर्मित विश्व का सबसे पुराना शहर माना जाता है जो की सिन्धु घटी की सभ्यता से जुड़ा है। यह पहले भारत में था परन्तु 1947 के बाद पाकिस्तान के अलग होने पर यह पाकिस्तान का हिस्सा है।\n" +
            "मोहन जोदड़ो की खोज साल 1922 में भारतीय पुरातत्व सर्वेक्षण के ऑफिसर R. D. Banerji आर. डी. बनर्जी ने किया था। यह शहर का अवशेष सिन्धु नदी के किनारे सक्खर ज़िले में स्थित है। हड्डापा में दो साल तक बहुत ही ज्यादा खुदाई के बाद, हड्डापा से कुछ 590 किलोमीटर उत्तर दिशा में मोहन जोदड़ो की खोज हुई। साल 1930 में इस जगह में बहुत ज्यादा खुदाई की गयी जॉन मार्शल, के. एन. दीक्षित, अर्नेस्ट मक्के के निर्देश के अनुसार।\n" +
            "बाद में मोहन जोदड़ो की ज्यातर खुदाई साल 1964-1965 में डॉ. जी. ऍफ़. डेल्स ने किया। इसके बाद इसकी खुदाई को रोक दिया गया ताकि इसकी संरचनाओं को सुरक्षित रखने के लिए तथा गलने या अपक्षय होने से रोकने के लिए माना जाता है कि यह शहर 200 हेक्टेयर क्षेत्र में फैला था और कहा जाता है 100 साल में जितना भी खुदाई हुआ है वह मात्र इस सहर का एक तिहाई ही है। इसकी खुदाई में बड़े पैमाने में इमारतें, धातुओं की मूर्तियाँ और मुहरें आदि मिलें हैं। harappa history\n" +
            "वर्ष 1980 के  व्यापक वास्तु दस्तावेज में, मोहन जोदड़ो के विस्तृत सतह सर्वेक्षण और सतह की जांच जर्मन और इटली के टीम डॉ. माइकल जनसन और डॉ. मोरिज़ो टोसी ने किया।\n" +
            "मोहन जोदड़ो के रहस्यमयी तथ्य---" +
            "#1 कहा जाता है यह सभ्यता 5500 साल पुराना होने के साथ-साथ इसकी जनसँख्या 40000 से भी अधिक थी। लेकिन IIT खरगपुर के वैज्ञानिकों ‘भारतीय पुरातत्व सर्वेक्षण’ (ए.एस.आई) नें हाल ही में सबूतों से साथ खुलसा किया है कि सिंधु घटी सभ्यता और मोहन जोदड़ो 5500 नहीं बल्कि 8000 वर्ष पुरानी सभ्यता है।\n" +
            "#2 सिन्धु घटी संस्कृति में ऐसे कई स्थान पाए गए हैं जहाँ लोग रहा करते थे और साथ ही अवशेषों से यह भी ज्ञात हुए है की उस समय युद्ध का कोई नाम भी नहीं लेता था। साथ ही वे पानी के लिए कुओं का भी उपयोग करते थे।\n" +
            "#3 मोहन जोदड़ो विश्व की सबसे बड़ी सभ्यता के रूप में पाई गयी है जो 4 प्राचीन नदी से जुडी हुई है तथा यह पाकिस्तान, भारत और अफगानिस्तान में कुल 12 लाख वर्ग किलोमीटर क्षेत्र में फैला हुआ है।\n" +
            "#4 मोहन जोदड़ो के समय काल में लोग पत्थरों के आभूषण पहनना बहुत पसंद करते थे। ये आभूषण बहुत ही कीमती पत्थरों से तैयार किये जाते थे।","आदर्शवादी तथा बहुमुखी प्रतिभा सम्पन्न, मानव सभ्यता का अग्रदूत तथा प्राचीन भारतीय इतिहास का दैदिप्त्यमान सितारा अशोक एक महान सम्राट था। सभी इतिहासकारों की दृष्टी से अशोक का शासनकाल स्वर्णिम काल कहलाता है।\n" +
            "\n" +
            "अशोक बिंदुसार का पुत्र था , बौद्ध ग्रन्थ दीपवंश में बिन्दुसार की 16 पत्नियों एवं 101 पुत्रों का जिक्र है। अशोक की माता का नाम शुभदाग्री था। बिंदुसार ने अपने सभी पुत्रों को बेहतरीन शिक्षा देने की व्यवस्था की थी। लेकिन उन सबमें अशोक सबसे श्रेष्ठ और बुद्धिमान था। प्रशासनिक शिक्षा के लिये बिंदुसार ने अशोक को उज्जैन का सुबेदार नियुक्त किया था। अशोक बचपन से अत्यन्त मेघावी था। अशोक की गणना विश्व के महानतम् शासकों में की जाती है।\n" +
            "\n" +
            "सुशीम बिंदुसार का सबसे बड़ा पुत्र था लेकिन बिंदुसार के शासनकाल में ही तक्षशीला में हुए विद्रोह को दबाने में वह अक्षम रहा। बिंदुसार ने अशोक को तक्षशीला भेजा। अशोक वहाँ शांति स्थापित करने में सफल रहा। अशोक अपने पिता के शासनकाल में ही प्रशासनिक कार्यों में सफल हो गया था। जब 273 ई.पू. में बिंदुसार बीमार हुआ तब अशोक उज्जैन का सुबेदार था। पिता की बिमारी की खब़र सुनते ही वह पाटलीपुत्र के लिये रवाना हुआ लेकिन रास्ते में ही अशोक को पिता बिंदुसार के मृत्यु की ख़बर मिली। पाटलीपुत्र पहुँचकर उसे उन लोगों का सामना करना पड़ा जो उसे पसंद नही करते थे। युवराज न होने के कारण अशोक उत्तराधिकार से भी बहुत दूर था। लेकिन अशोक की योग्यता इस बात का संकेत करती थी कि अशोक ही बेहतर उत्तराधिकारी था। बहुत से लोग अशोक के पक्ष में भी थे। अतः उनकी मदद से एंव चार साल के कड़े संघर्ष के बाद 269 ई.पू. में अशोक का औपचारिक रूप से राज्यभिषेक हुआ।\n" +
            "\n" +
            "अशोक ने प्रशाश्कीय क्षेत्र में जिस त्याग, दानशीलता तथा उदारता का परिचय दिया एवं मानव को नैतिक स्तर उठाने की प्रेरणा दी वो विश्व इतिहास में कहीं और देखने को नही मिलती है। अशोक ने शासन को सुचारू रूप से चलाने के लिये अनेक सुधार किये और अनेक धर्म-महापात्रों की नियुक्ति की। अशोक अपनी जनता को अपनी संतान की तरह मानता था। उसने जनहित के लिये प्रांतीय राजुकों को नियुक्त किया। अशोक के छठे लेख से ये स्पष्ट हो जाता है कि वो कुशल प्रशासक था। उसका संदेश था –\n" +
            "\n" +
            "    प्रत्येक समय मैं चाहे भोजन कर रहा हूँ या शयनागार में हूँ, प्रतिवेदक प्रजा की स्थिति से मुझे अवगत करें। मैं सर्वत्र कार्य करूंगा प्रजा हित मेरा कर्तव्य है और इसका मूल उद्योग तथा कार्य तत्परता है।\n" +
            "\n" +
            "अशोक की योग्यता का ही परिणाम था कि उसने 40 वर्षों तक कुशलता से शासन किया, यही वजह है कि सदियों बाद; आज भी लोग अशोक को एक अच्छे शाशक के रूप में याद करते हैं।\n"+"अशोक युद्ध के लिये इतना प्रसिद्ध नही हुआ जितना एक धम्म विजेता के रूप में प्रसिद्ध हुआ। वह न केवल मानव वरन सम्पूर्ण प्राणी जगत के प्रति उदारता का दृष्टीकोण रखता था। इसी कारण उसने पशु पक्षियों के वध पर प्रतिबंध लगा दिया था। अशोक ने लोकहित के लिये छायादार वृक्ष, धर्मशालाएं बनवाई तथा कुएं भी खुदवाये। उसने मनुष्यों व पशुओं के लिये उपयोगी औषधियों एवं औषधालयों की व्यवस्था की थी।\n" +
            "\n" +
            "अपने साम्राज्य की सीमाओं की सुरक्षा तथा दक्षिण भारत से व्यापार की इच्छा हेतु अशोक ने 261 ई.पू. में कलिंग पर आक्रमण किया। युद्ध बहुत भीषण हुआ। इस युद्ध में अशोक को विजय हासिल हुई। जिसका विवरण अशोक के तेरहवें शिलालेख में अंकित है। विजयी होने के बावजूद अशोक इस जीत से खुश नही हुआ क्योंकि इस युद्ध में नरसंहार का ऐसा तांडव हुआ जिसे देखकर अशोक का मन द्रविभूत हो गया। युद्ध की भीषणता का दिलो-दिमाग पर ऐसा असर हुआ कि अशोक ने युद्ध की नीति का सदैव के लिये त्याग कर दिया। उसने दिग्विजय की जगह धम्म विजय को अपनाया। उसने अपने कर्मचारियों को आदेश दिया कि कलिंग की जनता के साथ पुत्रवत् व्यवहार किया जाये तथा सभी के साथ न्यायपूर्ण व्यवहार हो। उसने अपने आदेश को शिलालेख पर लिखवाया। ये आदेश धौली व जोगदा शिलालेखों पर अंकित है। कलिंग के युद्ध के बाद सम्राट अशोक के व्यवहार में अद्भुत परिवर्तन हुआ और कलिंग युद्ध उसका अंतिम सैन्य अभियान था। अशोक की इस शान्ति प्रिय निती ने उसे अमर बना दिया।\n" +
            "\n" +
            "अशोक ने अपने शासन काल में बंदियों की स्थिति में भी सुधार किये। उसने वर्ष में एक बार कैदियों को मुक्त करने की प्रथा का प्रारंभ किया था। अशोक ने राज्य का स्थाई रूप से दौरा करने के लिये व्युष्ट नामक अधिकारी नियुक्त किये थे। कलिंग विजय के पश्चात अशोक का साम्राज्य विस्तार बंगाल की खाड़ी तक हो गया था। नेपाल तथा कश्मीर भी मगध राज्य में थे। दक्षिण में पन्नार नदी तक साम्राज्य विस्तृत था। उत्तर पश्चिम में अफगानिस्तान व बलूचिस्तान भी अशोक के साम्राज्य का हिस्सा था।\n" +
            "\n" +
            "अशोक ने धम्म सम्बन्धी अपने सिद्धान्त को अपने अभिलेखों में अभिव्यक्त किया है।\n" +
            "\n" +
            "प्रथम शिलालेख मे लिखा है- “यज्ञ अथवा भोजन के लिये पशुओं की हत्या न करना ही उचित है।” इसी के साथ अशोक ने माता-पिता, गुरु एवं बड़े बुजुर्गों का आदर सत्कार का संदेश भी शिलालेख पर अंकित करवाया। अशोक के धम्म प्रचार का मुख्य उद्देश्य समाज में शांति और सोहार्द की वृद्धी करना था।" +
            "उसने अपने पुत्र महेन्द्र और पुत्री संधमित्रा को श्री लंका में बौद्ध प्रचार के लिये भेजा अशोक द्वारा लिखवाये गये अधिकांश शिला-अभिलेख धम्म प्रचार के साधन थे।\n" +
            "अशोक के अधिकांश संदेश ब्रह्मी लिपि में हैं। कुछ अभिलेखों में खरोष्ठी तथा आरमेइक लिपि का भी प्रयोग हुआ है। सर्व प्रथम 1837 में जेम्स प्रिंसेप नामक विद्वान ने इसे पढने में सफलता हासिल की थी।\n" +
            "\n" +
            "अशोक द्वारा लिखवाये अभिलेखों को चार भागों में विभाजित किया गया है, चौदह -शिलालेख, लघु-शिलालेख, स्तम्भ-शिलालेख तथा लघु-स्तम्भ शिलालेख। अशोक ने अपने शासनकाल में अनेक स्तंभ बनवाये थे उसमें से आज लगभग 19 ही प्राप्त हो सकें हैं। इनमें से हमारी संस्कृति की धरोहर अशोक स्तंभ को राष्ट्रीय चिन्ह के रूप में अंगीकार किया गया है। स्तंभ में स्थित चार शेर शक्ति, शौर्य, गर्व और आत्वविश्वास के प्रतीक हैं। अशोक स्तंभ के ही निचले भाग में बना अशोक चक्र आज राष्ट्रीय ध्वज की शान बढ़ा रहा है।\n" +
            "\n" +
            "अशोक में कर्तव्यनिष्ठा का प्रबल भाव था। उसने घोषणां की थी कि,\n" +
            "\n" +
            "     मैं जो कुछ भी पराक्रम करता हूँ, वह उस ऋण को चुकाने के लिये है, जो सभी प्राणियों का मुझपर है।\n" +
            "\n" +
            "सम्राट अशोक की मृत्यु की तिथी एवं कारण को लेकर अनेक भ्रान्तियां हैं। कुछ इतिहासकारों के अनुसार अशोक की मृत्यु 232 ई.पू. में हुई थी।","पूरा नाम – महाराणा प्रताप\n" +
            "जन्म   –  9 मे, 1540\n" +
            "जन्मस्थान – कुम्भलगढ़ दुर्ग\n" +
            "पिता  – राणा उदय सिंह.\n" +
            "माता – महाराणी जयवंता कँवर\n" +
            "विवाह Wives of Maharana Pratap – उन्होंने 11 शादियाँ की थी – महारानी अजब्धे पंवार, अमरबाई राठौर, शहमति बाई हाडा, लखाबाई, जसोबाई चौहान और 6 पत्निया.\n" +
            "संतान Son of Maharana Pratap  – अमर सिंह, भगवान दास और 17 पुत्र\n"+"महाराणा प्रताप का इतिहास – \n" +
            "\n" +
            "बचपन से ही महाराणा प्रताप साहसी, वीर, स्वाभिमानी एवं स्वतंत्रताप्रिय थे. सन 1572 में मेवाड़ के सिंहासन पर बैठते ही उन्हें अभूतपूर्व संकोटो का सामना करना पड़ा, मगर धैर्य और साहस के साथ उन्होंने हर विपत्ति का सामना किया. मुगलों की विराट सेना से\n" +
            "\n" +
            "हल्दी घाटी में उनका भरी युद्ध हुआ. वहा उन्होंने जो पराक्रम दिखाया, वह भारतीय इतिहास में अद्वितीय है, उन्होंने अपने पूर्वजों की मान – मर्यादा की रक्षा की और प्रण किया की जब तक अपने राज्य को मुक्त नहीं करवा लेंगे, तब तक राज्य – सुख का उपभोग नहीं करेंगे. तब से वह भूमी पर सोने लगे, वह अरावली के जंगलो में कष्ट सहते हुए भटकते रहे, परन्तु उन्होंने मुग़ल सम्राट की अधीनता स्वीकार नहीं की. उन्होंने अपनी मातृभूमि की रक्षा के लिए अपना जीवन अर्पण कर दिया.\n" +
            "\n" +
            "महाराणा प्रताप ने वीरता का जो आदर्श प्रस्तुत किया, वह अद्वितीय है. उन्होंने जिन परिस्थितियों में संघर्ष किया, वे वास्तव में जटिल थी, पर उन्होंने हार नहीं मानी. यदि राजपूतो को भारतीय इतिहास में सम्मानपूर्ण स्थान मिल सका तो इसका श्रेय मुख्यत: राणा प्रताप को ही जाता है. उन्होंने अपनी मातृभूमि को न तो परतंत्र होने दिया न ही कलंकित. विशाल मुग़ल सेनाओ को उन्होंने लोहे के चने चबाने पर विवश कर दिया था. मुगल सम्राट अकबर उनके राज्य को जीतकर अपने साम्राज्य में मिलाना चाहते थे, किन्तु राणा प्रताप ने ऐसा नहीं होने दिया और आजीवन संघर्ष किया.\n"+"मुग़ल साम्राज्य का सूर्य तो डूब गया, किन्तु राणा प्रताप की गौरवगाथा आज भी गायी जाती है. कर्नल टॉड सहित कई विदेशी इतिहासकारो ने उनके स्वाभिमान की प्रशंसा की है. कहा जाता है की राणा के देहांत की खबर पाकर स्वयं अकबर की आखें डबडबा आयी थीं.\n" +
            "\n" +
            "महाराणा प्रताप भारतीय इतिहास के एक अत्यंत गौरवशाली पात्र है. उनके त्याग, शौर्य और राष्ट्रभक्ति की तुलना किसी से नहीं की जा सकती. वह आज भारत में शौर्य, साहस और स्वाभिमान का प्रतीक बन गये है.\n" +
            "\n" +
            "मृत्यु (Death) – 57 साल की उम्र में वह स्वर्ग सिधार गये.","पूरा नाम –  बाजीराव बल्लाल (बालाजी ) भट्ट\n" +
            "जन्म      –  18 अगस्त 1700\n" +
            "जन्मस्थान – कोकणस्थ प्रान्त\n" +
            "पिता       –   बालाजी विश्वनाथ\n" +
            "माता      –   राधाबाई बर्वे\n" +
            "पत्नीं     –    काशीबाई और मस्तानी\n" +
            "Bajirao Mastani Story\n" +
            "\n" +
            "बाजीराव का जन्म ब्राह्मण परिवार में बालाजी विश्वनाथ के पुत्र के रूप में कोकणस्थ प्रान्त में हुआ था, जो छत्रपति शाहू के प्रथम पेशवा थे. २० वर्ष की आयु में उनके पिता की मृत्यु के पश्यात शाहू ने दुसरे अनुभवी और पुराने दावेदारों को छोड़कर बाजीराव को पेशवा के रूप में नियुक्त किया. इस नियुक्ति से ये स्पष्ट हो गया था की शाहू को बाजीराव के बालपन में ही उनकी बुद्धिमत्ता का आभास हो गया था, इसलिए उन्होंने पेशवा पद के लिए बाजीराव की नियुक्ति की. बाजीराव सभी सिपाहीयो के बिच लोकप्रिय थे और आज भी उनका नाम आदर और सम्मान के साथ लिया जाता है.\n" +
            "बाजीराव, वह थे जिन्होंने 41 या उस से भी ज्यादा लड़ाईयां लड़ी थी, और एक भी ना हारने की वजह से विख्यात थे. जनरल मोंटगोमेरी, ब्रिटिश जनरल और बाद में फील्ड मार्शल ने द्वितीय विश्व युद्ध के बाद लिखीत रूप में यह स्वीकार भी किया था.\n" +
            "\n" +
            "अपने पिता के ही मार्ग पर चलकर, मुघल सम्राटो को समझकर उनकी कमजोरियों को खोजकर उन्हें तोड़ने वाले बाजीराव पहले व्यक्ति थे. सैयद बन्धुओ की शाही दरबार में घुसपैठी या दखल-अंदाजी बंद करवाना भी उनके आक्रमण का एक प्रभावी निर्णय था.\n" +
            "\n" +
            "बाद में ग्वालियर के रानोजी शिंदे का साम्राज्य, इंदोर के होल्कर(मल्हारराव), बारोदा के गायकवाड (पिलाजी), और धार के पवार (उदाज्जी) इन सभी का निर्माण बाजीराव द्वारा मराठा साम्राज्य के खंड के रूप में किया गया, क्यूकी वे मुघल साम्राज्य से प्रतीशोध लेकर उनका विनाश कर के उनकी “जागीरदारी” बनाना चाहते थे.\n"+"उन्होंने अपना स्तंभ सासवड से और मराठा साम्राज्य की प्रशासनिक राजधानी/पूँजी को 1728 में सातारा से पुणे ले गये. इसी प्रक्रिया के दौरान, उन्होंने एक कसबे को शहर बनाने की भी नीव रखी. उनके प्रमुख, बापुजी श्रीपाट ने सातारा के कई धनवान परिवारों को पूना स्थापित होने के लिए मनाया, जो 18 पेठ में विभाजीत किया गया था.\n" +
            "\n" +
            "1732 में महाराजा छत्रसाल की मृत्यु पश्यात, मराठा साम्राज्य मित्र साम्राज्य रूपी था, जबकि बाजीराव को छत्रसाल साम्राज्य का एक तिहाई भाग बुन्देलखण्ड में दिया गया.\n" +
            "\n" +
            "एक उत्कृष्ट सेना का सेनापती होने की वजह से उनकी सेना और लोग उन्हें बहोत चाहते थे. वे कई बार हिंदु धर्म की रक्षा करने के लिए मुघलो से लड़े और उन्हें धुल भी चटाई, और हमेशा के लिए मुघलो को उत्तरी भारत पर ध्यान करने पूर्व ही मध्य और पश्चिमी भारत से दूर रखा. और इसी संकेत पर चलते हुए मराठाओ ने सिद्दी (मुघल नौसेनापति), मुघल, पुर्तगाल, निज़ाम, बंगाश इत्यादि को हराया.\n" +
            "\n" +
            "देखा जाये तो शिवाजी महाराज के बाद बाजीराव ने ही मराठा साम्राज्य का सबसे बड़ा चित्र साकार/निकाला था, ब्रिटिश पॉवर 19 वी सदी में स्थापित होने से पूर्व तक मराठा साम्राज्य प्रभावशाली रूप से 18 वी सदी तक चलता रहा.\n" +
            "\n" +
            "काशीबाई :\n" +
            "\n" +
            "बाजीराव की शादी काशीबाई से हुई, और उन्हें दो जुड़वाँ बच्चे भी हुए. बाद में नानासाहेब को शाहू ने 1740 में नए पेशवा के रूप में नियुक्त किया. उनके दुसरे बेटे का नाम रघुनाथराव था.\n" +
            "\n" +
            "मस्तानी / Mastani Story In Hindi :\n" +
            "\n" +
            "मस्तानी पेशवा बाजीराओ की दुसरी पत्नी थी, बाजिराव चौथे मराठा छत्रपति शाहूजी राजे भोसले के साम्राज्य में मराठाओ के सेनापति और प्रधान थे. ऐसा कहा जाता है की मस्तानी बहोत बहादुर और सुंदर महिला थी.\n" +
            "\n" +
            "इतिहास में बहोत से प्रसिध्द व्यक्ति मस्तानी से जुड़े है, और उनसे जुडी बहोत सी कथाये भी है. मस्तानी बुंदेला के राजपूत नेता महाराजा छत्रसाल (1649-1731) की पुत्री थी, जो बुदेलखंड प्रान्त के संस्थापक थे. मस्तानी को जन्म उनकी, फारसी-मुस्लिम पत्नी रूह्यानिबाई ने दिया जो हैदराबाद के निज़ाम के दरबार में नर्तकी थी. जब 1727-28 के समीप अल्लाहाबाद के मुघल प्रमुख मोहम्मद खान बंगाश ने छत्रसाल साम्राज्य पर आक्रमण किया तब छत्रसाल ने एक गुप्त सन्देश भेजा जिसमे उन्होंने बाजीराव प्रथम से सहायता मांगी थी. जिससे उनकी सैन्य शक्ति बढ़ सके. बाजीरावाला तुरंत महाराजा छत्रसाल की सहायता के लिए आगे बढे, और धन्यवाद् के स्वरुप छत्रसाल ने बाजीराव को उपहार स्वरुप अपनी बेटी मस्तानी दी और उनके साम्राज्य का एक तिहाई भाग भी दिया जिसमे झाँसी, सागर और कालपी का भी समावेश था. महाराजा छत्रसाल ने बाजीराव और मस्तानी के विवाह उपलक्ष में हीरो की खदान भेट स्वरुप दी.\n" +
            "\n" +
            "ऐसे कई सारे प्रसंग मस्तानी के जीवन से जुड़े है, छत्रसाल के दुसरे दृष्टिकोण से देखा जाये तो, वो हैदराबाद के निज़ाम की कन्या थी. छत्रसाल ने निज़ाम को 1698 में पराजित किया था, और निजाम की पत्नी ने बुन्देल और उनके बिच अच्छे सम्बन्ध स्थापित होने हेतु उनकी बेटी से विवाह करने की सलाह दी क्यूकी उस समय मध्य भारत में छत्रसाल साम्राज्य सबसे सशक्त और शक्तिशाली साम्राज्य था.\n" +
            "\n" +
            "कहानी के तीसरे अध्याय के अनुसार, बाजीराव और छत्रसाल की मित्रता होने के पश्चात, मस्तानी ये छत्रसाल के दरबार की नर्तकी थी. बाजीराव, मस्तानी के प्रेम में पड़ने के बाद उनका मस्तानी से विवाह हुआ. जिसका बाजीराव उच्च दर्जे के ब्राह्मण होने की वजह से पुरे ब्राह्मण समुदाय एवं हिन्दुओ ने विरोध किया.\n" +
            "\n" +
            "जहा बाजीराव ने स्वीकार किया था की मस्तानी यह छत्रसाल के फारसी-मुस्लिम पत्नी की बेटी थी. मस्तानी का वैध रूप से विवाह होने के बावजूद अक्सर उसे बाजीराव की रखैल या प्रेमिका कहा जाता था.\n" +
            "\n" +
            "मस्तानी एक कुशल घुड़सवार थी, और साथ साथ भाला फेक और तलवारबाजी भी करती थी और एक बुद्धिमान नर्तकी एवम गायिका थी. मस्तानी ने हमेशा सैन्य अभियान में बाजिराओ का साथ दिया. मस्तानी और बाजिराओ की पहली पत्नी काशीबाई ने बाजिराव को एक-एक पुत्र दिया परन्तु काशीबाई का पुत्र जल्दी ही मारा गया और मस्तानी का पुत्र था जिसका नाम शमशेर बहादुर था.\n" +
            "\n" +
            "बाजिराओ ने शमशेर को बन्दा की जागीर प्रदान की. शमशेर (पेशवा) १७६१ के पानीपत के तीसरे युद्ध में अहमद शाह अब्दली के खिलाफ मराठाओ की तरफ से लड़ा था और ये कहा जाता है की युद्ध के दौरान उसे वीरगति प्राप्त हुई.\n" +
            "\n" +
            "बाजिराओ काशीबाई और उनकी माता राधाबाई के मस्तानी के प्रति क्रोध को नज़रंदाज़ कर के अपनी अर्ध-मुस्लिम पत्नी मस्तानी को प्रेम करता गया. राधाबाई की और से रहते हुए बाजिराओ का भाई हमेशा मस्तानी को वनवास भेजने की नाकाम कोशिश करता रहता था. बाजिराओ का पुत्र बालाजी भी मस्तानी को उनके पिता को छोड़ने के लिए मजबूर करता था लेकिन मस्तानी इस सब से असहमत थी.परन्तु बाजिराओ बार बार इसे नज़रंदाज़ करते गये और इसीका फायदा उठाते हुए बालाजी ने मस्तानी को जब बाजिराओ अपने सैन्य अभियान में व्यस्त थे तब कुछ समय के लिए उसे घर में ही कैद कर के रखा.\n" +
            "\n" +
            "बाद में कुछ समय पच्छात मस्तानी बाजिराओ के साथ पुणे के शनिवार वाडा के पास राजमहल में रहने लगी. महल के उत्तर पूर्व किनारों पर महल को “मस्तानी महल” और बाहरी द्वार को “मस्तानी दरवाज़ा” का नाम दिया गया. बाजिराओ के परिवार के मस्तानी के साथ दुर्व्यहार के कारण बाद में बाजिराओ ने मस्तानी के लिए 1734 में कोथरुड में एक अलग निवास स्थान बनाया, जो शनिवार वाडा से कुछ ही दुरी पर था. ये स्थान आज भी कर्वे रोड पर “मृत्युंजय मंदिर” के नाम से जाना जाता है. जहा कोथरुड के महल के टुकड़े टुकड़े कर दिए गये थे वो आज भी राजा केलकर संग्रहालय के विशेष विभाग में देखा जा सकता है. परन्तु इस सम्बन्ध में मस्तानी से जुड़े कोई सरकारी कागज़ बाजिराओ के साम्राज्य में दिखाई नहीं देते.\n" +
            "\n" +
            "इतिहासकारों का ऐसा मान ना है की राजा केलकर संग्रहालय और वाई संग्रहालय में जो बाजिराओ और मस्तानी की पेंटिंग्स लगी है वो प्रमाणिक या असली नहीं है.\n" +
            "\n" +
            "मृत्यु :\n" +
            "\n" +
            "28 अप्रैल 1740 में जब बाजिराओ अपने खरगांव की जमीन का निरिक्षण कर रहे थे तब आकस्मिक बुखार के वजह से उनकी मृत्यु 39 वर्ष की आयु में हुई. तब काशीबाई, चिमाजी अप्पा, बालाजी (नानासाहेब) और मस्तानी भी खरगांव आये थे. जहा 28 अप्रैल 1740 को नर्मदा नदी के किनारे रावेर खेड में उनके शरीर को अग्नि दी गयी. और इसके कुछ समय बाद ही पुणे के समीप पबल गाव में मस्तानी की मृत्यु हो गयी.\n" +
            "\n" +
            "उनके लिए दिल्ली में (100000) सैन्य का रास्ता भी बनाया गया जिसका शिवीर खरगोन जिले में इंदोर के पास बना हुआ है. उनकी याद में एक शिव मंदिर भी बनाया गया जो उसी के निकट स्थित है.\n" +
            "\n" +
            "मस्तानी  मृत्यु का कारण :\n" +
            "\n" +
            "पौराणिक कथाओ के अनुसार, बाजिराओ के मृत्यु की खबर सुनते ही मस्तानी ने अपनी अंगूठी का ज़हर पीकर आत्महत्या कर ली थी. वही दुसरो का ऐसा मानना है की उसके पति के दाह संस्कार के वक़्त उसने बाजिराओ की चिता पर छलांग लगाई थी. परन्तु इस प्रकार का कोई प्रमाण मौजूद नहीं है जो मस्तानी की मृत्यु का असली कारण बता सके. परन्तु ये अक्सर कहा जाता है की बाजिराओ की 1740 में मृत्यु के पच्छात मस्तानी ज्यादा दिन तक नहीं जीवित रही.","पूरा नाम – जहीर-उद-दिन  मुहम्मद बाबर.\n" +
            "जन्म      – 14 फरवरी, 1483.\n" +
            "जन्मस्थान  – अन्दिझान (उज्बेकिस्तान).\n" +
            "पिता       – उमर शेख मिर्जा 2\n" +
            "माता      – Qutlugh Nigar Khanum.\n" +
            "विवाह    – आयेशा सुलतान बेगम, जैनाब सुलतान बेगम, मौसमा सुलतान बेगम, महम बेगम, गुलरुख बेगम,\n" +
            "दिलदार अघाबेगम, मुबारका युरुफझाई, सहिला सुलतान बेगम, हज्जाह गुलनार अघाचा. नाझगुल अघाचा. बेगा बेगम.\n" +
            "\n" +
            "बाबर / Babar शब्द का अर्थ ‘सिंह’ है और वे इतिहास में इसी नाम से प्रसिध्द हैं. बाबर तैमुरलंग और चंगेजखा जैसे बहादुर मंगोल सरदारों के वंशज थे, जिनकी क्रूरता और वीरता के अनेक उदाहरण इतिहास के पृष्ठों में भरे पड़े हैं. परन्तु\n" +
            "\n" +
            "बाबर अपने इन वंशजों से कुछ भिन्न थे. इनके पूर्वज जहां दिल्ली तक पहुंचे और यहां मारकाट करने के बाद लूट ला माल लेकर वापीस चले गये, पर बाबर हिन्दुस्तान के ही होकर रह गये. उन्होंने  अपने-आपको विदेशी नहीं माना.\n" +
            "\n" +
            "बाबर ने पानीपत की लड़ाई में दिल्ली के लोधी सुल्तान को भारी शिकस्त दी और उसके बाद दिल्ली के राजसिंहासन पर कब्जा करके उसके आस-पास के प्रदेशों को भी जीतकर अपने साम्राज्य का हिस्सा बनाया. इस प्रकार भारत में मृगल सल्तनत की आधारशिला रखी.\n" +
            "भारत में उस समय अनेक छोटे-छोटे राजओं, सामन्तों और जागीरदारों की कमी न थी. बाबर ने बहुत बड़े हिस्से को जीतकर भारत में एकता स्थापित करने का प्रयत्न किया और सम्भवत: बहुत अरसे के बाद यह भारत को एक सुत्र में बांधने का प्रयत्न था.\n" +
            "इस प्रकार वह 1527 तक भारत के बहुत बड़े हिस्से पर अपना अधिकार जमा चूका था. बाबर की विशेषता यह थी कि उन्होंने यहीं का होकर रहने में अपनी भलाई समझी और इस प्रकार मृगल-साम्राज्य की स्थापना के लिए महत्त्वपूर्ण कार्य किया. उसने अपने राज्य की स्थापना के बाद लुट-खसोट के बदले विभिन्न प्रदेशों को संगठित करने का कार्य किया.\n" +
            "बाबर बहुत सुरुचिपूर्ण व्यक्ति थे. उनके प्रभाव से भारत की नष्टप्राय कलाओं का विकास फिर से प्रारंभ हुआ. उन्होंने अपने संस्मरण भी लिखे.","पूरा नाम   – अबुल मुजफ्फर मुहीउद्दीन औरंगजेब आलमगीर. Aurangzeb\n" +
            "जन्मस्थान  – दाहोद (गुजरात)\n" +
            "पिता        – शाहजहां\n" +
            "माता        – मूमताज महल\n" +
            "विवाह      – बेगम नवाब बाई, औरंगाबादी महल, उदयपुरी महल, झैनाबदी महल\n" +
            "औरंगजेब का जन्म गुजरात के दाहोद गाव में हुआ। शाह जहाँ और मूमताज महल के वो तीसरे बेटे थे। 26 फेब्रुअरी 1628 में जब शाहजहा ने लिखित तौर पर ये बताया की औरंगजेब ही उनके तख़्त के काबिल है। इसके बाद औरंगजेब को बाहर युद्ध विद्या सिखने भेजा गया, और युद्ध कला में निपुण होने के बाद वे फिर से अपने परिवार के साथ रहने लगे।\n" +
            "\n" +
            "शाह जहाँ जब बूढ़े होकर बीमार हो गये तो औरंगजेब / Aurangzeb ने उन्हें कैद में डाला। कुछ इतिहासकरों का ऐसा कहना है की,\n" +
            "\n" +
            "शाह जहाँ ताजमहल पर पूरा मुग़ल ख़जाना खर्च कर रहें थे इसीलिए उन्हें कैद में डाला गया। शाहजहां की मौत कैदखाने में हुई। इस तरह वे हिन्दुस्तान के एकछत्र सम्राट बन गये।" +
            "औरंगजेब के पूर्वज अकबर, बाबर आदी शासकों ने भारत को जो समृध्दि प्रदान की थी, औरंगजेब ने उसमें वृध्दि तो अवश्य की परन्तु अपने कट्टरपन तथा अपने पिता और भाइयों के प्रति दुर्व्यवहार के कारण उन्हें देश की जनता का विरोध भी मोल लेना पड़ा।\n" +
            "\n" +
            "उन्होंने हिन्दुओं पर जजिया कर लगाया। वैसे नैतिक रूप से वे अच्छे चरित्र के व्यक्ति थे। वे टोपियां सीकर और कुरान की आयतें लिखकर अपना खर्चा चलाते थे। उन्होंने राज्य-विस्तार के लिए अनेक बड़ी-बड़ी लड़ाईयां लड़ीं।\n" +
            "\n" +
            "उनका शासन 1658 से लेकर उनकी मृत्यु 1707 तक चला। उन्होंने 48 साल तक अपना शासन स्थापीत रखा।\n" +
            "\n" +
            "औरंगजेब का राज्य बहोत ही विस्तृत था इस वजह से उस समय मुघल साम्राज्य सबसे विशाल और शक्तिशाली साम्राज्य माना जाता था। औरंगजेब के पुरे जीवन में उसने अपना राज्य दक्षिण में 3.5 लाख किलोमीटर तक विस्तृत किया और जिसमे 150-200 लाख लोग उसके राज्य में रहने लगे थे।\n" +
            "\n" +
            "28 मई 1633 में जब मुघल साम्राज्य युद्ध कर रहा था तभी अचानक एक लड़ाकू हाती ने उनके शरीर पर प्रहार किया, जिससे उन्हें कई दिनों तक चोटिल रहने के बाद भी वे युद्ध में लड़ते रहे, युद्ध का लगभग पूरा क्षेत्र हतियो से भरा पड़ा था और लड़ते-लड़ते ही अंत में उन्हें मृत्यु प्राप्त हुई। और उनकी इसी बहादुरी से प्रेरित होकर उन्हें बहादुर का शीर्षक दिया गया। अंतिम युद्ध में कमजोर पड़ने के बाद भी उन्होंने हार नहीं मानी थी। वे मुघल साम्राज्य के एक निडर योद्धा थे। उनका हमेशा से ऐसा मानना था की अगर आप बिना लड़ेही शत्रु की ताकत देखकर ही हार मान लेते हो तो फिर आपसे बुरा कोई नहीं।\n" +
            "\n" +
            "इसमें संदेह नहीं कि औरंगजेब मुगल सल्तनत के महान सम्राट थे और उनका समय मुग़ल-साम्राज्य की समृध्दि की समृध्दि का स्वर्णिम युग था।\n" +
            "\n" +
            "उनकी मृत्यु के 15-16 वर्ष बाद ही मुगल-साम्राज्य का सितारा डूब गया। बाबर के खानदान के इस अंतिम मुगल सम्राट The last Mughal को अनेक कारणों से याद किया जाता है। बाबर जहां भारत में मुगल-साम्राज्य के संस्थापक थे, वहां औरंगजेब मुगल-साम्राज्य की समाप्ति का कारण बने।\n" +
            "\n" +
            "औरंगज़ेब के निर्माण :-\n" +
            "\n" +
            "1) औरंगज़ेब नेलाहौर की बादशाही मस्जिद बनवाई थी।\n" +
            "2) 1678 ई. में औरंगज़ेब ने अपनी पत्नी रबिया दुर्रानी की स्मृति में बीबी का मक़बरा  बनवाया।\n" +
            "3) औरंगज़ेब ने दिल्ली के लाल क़िले में मोती मस्जिद बनवाई थी।\n" +
            "\n" +
            "औरंगजेब इतिहास के सबसे सशक्त और शक्तिशाली राजा माने जाते थे। उन्होंने पुरे भारत को अपने साम्राज्य में शामिल करने की कोशिश की।","आगरा का ताजमहल भारत की शान और प्रेम का प्रतीक चिह्न माना जाता है। उत्तरप्रदेश का तीसरा बड़ा जिला आगरा ऐतिहासिक दृष्टि से काफी महत्वपूर्ण है।\n" +
            "\n" +
            "मुगलों का सबसे पसंदीदा शहर होने के कारण ही उन्होंने \u200Dदिल्ली से पहले आगरा को अपनी राजधानी बनाया। इतिहास के अनुसार इब्राहिम लोदी ने इस शहर को सन् 1504 में बसाया था। जिस समय इस शहर की स्थापना की गई, उस समय किसी ने यह कल्पना नहीं की होगी कि यह शहर पूरे विश्व में अपनी खूबसूरती के लिए परचम लहराएगा। जिसे आज भी दुनिया के सात अजूबों में शुमार किया जाता है।\n" +
            "\n" +
            "इतिहास : स्थापत्य कला की जीती-जागती तस्वीर आगरा शहर दिल्ली से करीब 200 किलोमीटर की दूरी पर स्थित है। जिसे बनाने के लिए बगदाद से एक कारीगर बुलवाया गया जो पत्थर पर घुमावदार अक्षरों को तराश सकता था। इसी तरह बुखारा शहर, जो मध्य एशिया में स्थित हैं, वहां से जिस कारीगर को बुलवाया गया वह संगमरमर के पत्थर पर फूलों को तराशने में दक्ष था। विराट कद के गुंबदों का निर्माण करने के लिए तुर्की के इस्तम्बुल में रहने वाले दक्ष कारीगर बुलाया गया तथा मिनारों का निर्माण करने के लिए समरकंद से दक्ष कारीगर को बुलवाया गया।\n" +
            "\n" +
            "इस प्रकार ताजमहल के निर्माण से पूर्व छ: महीनों में कुशल कारीगरों को तराश कर उनमें से 37 दक्ष कारीगर इकट्ठे किए गए, जिनके देखरेख में बीस हजार मजदूरों के साथ कार्य किया गया। इसी प्रकार ताज निर्माण में लगाई गई सामग्री संगमरमर पत्थर राजस्थान के मकराणा से, अन्य कई प्रकार के कीमती पत्थर एवं रत्न बगदाद, अफगानिस्तान, तिब्बत, इजिप्त, रूस, ईरान आदि कई देशों से इकट्\u200Dठा कर उन्हें भारी कीमतों पर खरीद कर ताजमहल का निर्माण करवाया गया।\n" +
            "\n" +
            "ई. 1630 में शुरू हुआ इसका निर्माण कार्य करीब 22 वर्षों में पूर्ण हुआ, जिसमें लगभग बीस हजार मजदूरों का योगदान माना जाता है। इसका मुख्य गुंबद 60 फीट ऊंचा और 80 फीट चौड़ा है।\n" +
            "\nमुगल बादशाह की मुहब्बत और शिद्दत का परिणाम ही है, 'ताजमहल' जिसे खूबसूरती का नायाब हीरा कहा जाता है। गुंबदनुमा इस इमारत को जब आप सिर उठाकर ऊपर देखते हैं तो इसकी नक्काशीदार छतें और दीवारें किसी आश्चर्य से कम नहीं लगतीं। इसका यह इतिहास तो बच्चे-बड़े सभी की जुबान पर है कि मुगल बादशाह शाहजहां ने अपनी दूसरी पत्नी मुमताज महल की याद में ताजमहल का निर्माण करवाया था।\n" +
            "\n" +
            "यमुना नदी के किनारे सफेद पत्थरों से निर्मित अलौकिक सुंदरता की तस्वीर 'ताजमहल' न केवल भारत में, बल्कि पूरे विश्व में अपनी पहचान बना चुका है। प्यार की इस निशानी को देखने के लिए दूर देशों से हजारों सैलानी यहां आते हैं। दूधिया चांदनी में नहा रहे ताजमहल की खूबसूरती को निहारने के बाद आप कितनी भी उपमाएं दें, वह सारी फीकी लगती हैं।\n" +
            "\n" +
            "आगरा में ताजमहल के अलावा भी कई चीजें देखने लायक हैं :-\n" +
            "जैसे- 1. आगरा फोर्ट (रेड फोर्ट)। आगरा फोर्ट यहां के महत्\u200Dवपूर्ण इमारतों में से एक है। इसका निर्माण ई. 1565 में मुगल सम्राट अकबर ने करवाया था। स्थापत्य कला का यह बेजोड़ नमूना लाल पत्थरों से निर्मित हैं। इसमें जहांगीर महल (दीवाने-ए-खास) भी बना है, जो खूबसूरत शी\u200Dशमहल के रूप में प्रचलित है। 2. फतेहपुर सीकरी। आगरा से लगभग 35 किलोमीटर दूर स्थित इस स्थान को अकबर ने अपनी राजधानी बनाया था, जो स्थापत्य की बेजोड़ कलाओं से परिपूर्ण है। 3. मेहताब बाग। यमुना नदी की विपरीत दिशा में ताजमहल' के पास ही बना हुआ है मेहताब बाग। कई तरह के फूलों और अनेक पेड़-पौधों से सुसज्जित होने के कारण विदेशी\u200D सैला\u200Dनियों को काफी लुभाता है। 4. रामबाग। रामबाग को बाबर ने 1528 ई. में बनवाया था। यह ताजमहल के उत्तरी भाग में ढाई किलोमीटर क्षेत्र में फैला हुआ है, जिसे मुगलों द्वारा निर्मि\u200Dत सबसे पुराने बागों में से एक माना जाता है। 5. जामा मस्जिद। शाहजहां की बेटी जहांआरा बेगम की याद में सन् 1648 ई. में बनाई गई थी यह जामा मस्जिद। बड़ी ही खूबसूरती से इसके गुंबद भी तराशे गए हैं। इतने वर्षों बाद भी इसकी खूबसूरती जस-की-तस बनी हुई है।\n" +
            "\n" +
            "मुमताज महल और शाहजहां की कब्र ताजमहल के निचले हिस्से में आमने-सामने बनी हुई है। आज भी आगरा शहर देशी-विदेशी सैलानियों के आकर्षण का केन्द्र बना हुआ है। खूबसूरत स्थापत्य कला में निर्मित होने की वजह यहां गर्मी हो या ठंड, हर मौसम में पर्यटकों की भीड़ देखी जा सकती है। पर्यटन विभाग की ओर से प्रतिवर्ष 'ताज महोत्सव' का आयोजन किया जाता है। ","पूरा नाम   – अबुल-फतह जलाल उद्दीन मुहम्मद अकबर\n" +
            "जन्म   –  15 अक्तुबर, 1542.\n" +
            "जन्मस्थान   –   अमरकोट.\n" +
            "पिता Father of Akbar  –  हुमांयू\n" +
            "माता   –   नवाब हमीदा बानो बेगम साहिबा\n" +
            "शिक्षा   –   अल्पशिक्षित होने के बावजूद सैन्य विद्या में अत्यंत प्रवीण थे.\n" +
            "विवाह Wives of Akbar   –  रुकैया बेगम सहिबा, सलीमा सुल्तान बेगम सहिबा, मारियाम उज़-ज़मानि बेगम सहिबा, जोधाबाई राजपूत\n" +
            "संतान Son of Akbar  – जहाँगीर,\n" +
            "अकबर  प्रारंभिक जीवन – History of King Akbar\n" +
            "\n" +
            "अकबर हुमायु के बेटे थे, जिन्होंने पहले से ही मुघल साम्राज्य का भारत में विस्तार कर रखा था. 1539-40 में चौसा और कन्नौज में होने वाले शेर शाह सूरी से युद्ध में पराजित होने के बाद मुघल सम्राट हुमायु पश्चिम की और गये जहा सिंध में उनकी मुलाकात 14 साल की हमीदा बानू बेगम जो\n" +
            "\n" +
            "शैख़ अली अकबर की बेटी थी, उन्होंने उनसे शादी कर ली और अगले साल ही जलाल उद्दीन मुहम्मद का जन्म 15 अक्टूबर 1542 को राजपूत घराने में सिंध के उमरकोट में हुआ (जो अभी पकिस्तान में है) जहा उनके माता-पिता को वहा के स्थानिक हिंदु राना प्रसाद ने आश्रय दिया.\n" +
            "\n" +
            "और मुघल शासक हुमायु के लम्बे समय के वनवास के बाद, अकबर अपने पुरे परिवार के साथ काबुल स्थापित हुए. जहा उनके चाचा कामरान मिर्ज़ा और अस्करी मिर्ज़ा रहते थे. उन्होंने अपनी पुरानी जवानी शिकार करने में, युद्ध कला सिखने में, लड़ने में, भागने में व्यतीत की जिसने उसे एक शक्तिशाली, निडर और बहादुर योद्धा बनाया. लेकिन अपने पुरे जीवन में उन्होंने कभी लिखना या पढना नहीं सिखा था. ऐसा कहा जाता है की जब भी उन्हें कुछ पढने की जरुरत होती तो वे अपने साथ किसी को रखते थे जिसे पढना लिखना आता हो. 1551 के नवम्बर में अकबर ने काबुल की रुकैया से शादी कर ली. महारानी रुकैया उनके ही चाचा हिंदल मिर्ज़ा की बेटी थी. जो उनकी पहली और मुख्य पत्नी थी. उनकी यह पहली शादी अकबर के पिता और रुकैया के चाचा ने रचाई थी. और हिंदल मिर्ज़ा की मृत्यु के बाद हुमायु ने उनकी जगह ले ली.\n"+"शेर शाह सूरी से पहली बार पराजित होने के बाद, हुमायु में दिल्ली को 1555 में पुनर्स्थापित किया और वहा उन्होंने एक विशाल सेना का निर्माण किया. और इसके कुछ ही महीनो बाद हुमायु की मृत्यु हो गयी. अकबर को एक सफल शक्तिशाली बादशाह बनाने के लिए अकबर के रक्षक ने उनसे उनके पिता की मृत्यु की बात छुपाई. और अंत में 14 फेब्रुअरी 1556 को सिकंदर शाह को पराजित कर अकबर युद्ध में सफल हुए और वही से उन्होंने मुघल साम्राज्य का विस्तार शुरू किया. कलानौर, पंजाब में बैरम खान द्वारा 13 साल के अकबर को वहा की राजगद्दी सौपी गयी, ताकि वे अपने लिए एक नया विशाल साम्राज्य स्थापित कर सके. जहा उन्हें “शहंशाह” का नाम दिया गया. बैरम खान ने हमेशा अकबर का साथ दिया.\n" +
            "Jalaluddin Muhammad Akbar :\n" +
            "\n" +
            "अकबर एक बहादुर और शक्तिशाली शासक थे उन्होंने गोदावरी नदी के आस-पास के सारे क्षेत्रो को हथिया लिया था और उन्हें भी मुघल साम्राज्य में शामिल कर लिया था. उनके अनंत सैन्यबल, अपार शक्ति और आर्थिक प्रबलता के आधार पर वे धीरे-धीरे भारत के कई राज्यों पर राज करते चले जा रहे थे. अकबर अपने साम्राज्य को सबसे विशाल और सुखी साम्राज्य बनाना चाहते थे इसलिए उन्होंने कई प्रकार की निति अपनाई जिस से उनके राज्य की प्रजा ख़ुशी से रह सके.\n" +
            "\n" +
            "उनका साम्राज्य विशाल होने के कारण उनमे से कुछ हिंदु धर्म के भी थे, उनके हितो के लिए उसने हिंदु सम्राटो की निति को भी अपनाया और मुघल साम्राज्य में लागू किया. वे विविध धर्मो के बिच हो रहे भेदभाव को दूर करना चाहते थे. उनके इस नम्र स्वाभाव के कारण उन्हें लोग एक श्रेष्ट राजा मानते थे. और ख़ुशी-ख़ुशी उनके साम्राज्य में रहते थे. हिन्दुओं के प्रति अपनी धार्मिक सहिष्णुता का परिचय देते हुए उन्होंने उन पर लगा ‘जजिया’ नामक कर हटा दिया.अकबर में अपने जीवन में जो सबसे महान कार्य करने का प्रयास किया, वह था ‘दिन – ए – इलाही’ नामक धर्म की स्थापना. इसे उन्होंने सर्वधर्म के रूप में स्थापित करने की चेष्टा की थी. 1575 में उन्होंने एक ऐसे इबादतखाने (प्रार्थनाघर) की स्थापना की थी, जो सभी धर्मावलम्बियों के लिए खुला था, वो अन्य धर्मों के प्रमुख से धर्म चर्चायें भी किया करते थे.\n" +
            "\n" +
            "साहित्य एवं कला को उन्होंने बहुत अधिक प्रोत्साहन दिया. अनेक ग्रंथो, चित्रों एवं भवनों का निर्माण उनके शासनकाल में ही हुआ था. उनके दरबार में विभिन्न विषयों के लिए विशेषज्ञ नौ विद्वान् थे, जिन्हें ‘नवरत्न’ कहा जाता था.\n" +
            "\n" +
            "अकबर को भारत के उदार शासकों में गिना जाता है. संपूर्ण मध्यकालीन इतिहास में वो एक मात्र ऐसे मुस्लीम शासक हुए है जिन्होंने हिन्दू मुस्लीम एकता के महत्त्व को समझकर एक अखण्ड भारत निर्माण करने की चेष्टा की.\n" +
            "\n" +
            "भारत के प्रसिद्ध शासकों में मुग़ल सम्राट अकबर अग्रगण्य है,वो एकमात्र ऐसे मुग़ल शासक सम्राट थे, जिन्होंने हिंदू बहुसंख्यकों के प्रति कुछ उदारता का परिचय दिया,\n" +
            "\n" +
            "धीरे-धीरे भारत में मुघल साम्राज्य का विस्तार होने लगा और स्थिर आर्थिक परिस्थिती राज्य में आ रही थी. अकबर कला और संस्कृति के बहोत बड़े दीवाने थे इसलिए उन्होंने अपने शासन काल में इन दोनों के विकास पर ज्यादा से ज्यादा ध्यान दिया. उन्हें साहित्य का भी बहोत शौक था इसलिए उन्होंने 2400 खंड लिखवाए और उन्हें ग्रंथालय में प्रकाशित भी किया. उनकें साम्राज्य में कई भाषा के सैनिक थे जैसे की हिंदु, संस्कृत, ग्रीक, पर्शियन इत्यादि. अकबर ने हिंदु-मुस्लिम सम्प्रदायों के बिच की दुरिया कम करने के लिए दिन-ए-इलाही नामक धर्म की स्थापना की.\n" +
            "\n" +
            "उनका दरबार सबके लिए हमेशा से ही खुला रहता था. अकबर ने अनेक फारसी संस्कृति से जुड़े चित्रों को अपनी दीवारों पर बनवाया. अपने आरंभिक शासन काल में अकबर की हिन्दुओ के प्रति सहिष्णुता नहीं थी, किन्तु समय के साथ-साथ उसने अपने आप को बदला और हिन्दुओ सहित अन्य धर्मो में भी अपनी रूचि दिखाई. अकबर ने हिंदु राजपूत राजकुमारी से वैवाहिक भी किया. उनकी एक राणी जोधाबाई राजपूत थी. अकबर के दरबार में अनेक हिंदु दरबारी, सैन्य अधिकारी व सामंत थे. उसने धार्मिक चर्चाओ व वाद-विवाद कार्यक्रमों की अनोखी श्रुंखला आरम्भ की थी, जिसमे मुस्लिम आलिम लोगो की जैन, सीख, हिंदु, नास्तिक, पुर्तगाली एवम् कैथोलिक इसाई धर्मशास्त्रियो से चर्चा हुआ करती थी.\n" +
            "\n" +
            "मुघल साम्राज्य में निच्छित ही भारतीय इतिहास को प्रभावित किया था. उनकी ताकत और आर्थिक स्थिति सतत तेज़ी से बढती जा रही थी. अकबर ने अपने आर्थिक बल से विश्व की एक सबसे शक्तिशाली सेना बना रखी थी, जिसे किसी के लिए भी पराजित करना असंभव सा था. अकबर ने जो लोग मुस्लिम नहीं थे उनसे कर वसूल करना भी छोड़ दिया और वे ऐसा करने वाले पहले सम्राट थे, और साथ ही जो मुस्लिम नहीं है उनका भरोसा जितने वाले वे पहले सम्राट थे. अकबर के बाद, सफलता से उनका साम्राज्य उनका बेटा जहागीर चला रहा था.\n" +
            "\n" +
            "मृत्यु – \n" +
            "\n" +
            "3 अक्टूबर 1605 अकबर को पेचिश की बीमारी हुई, जिस से वे कभी ठीक नहीं हो पाए. उनकी मृत्यु 27 अक्टूबर 1605 को हुई, उसके बाद आगरा में उनकी समाधी बनाई गयी.","5th h ","6th h ","7th h ","8th h ","9th h"};
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_history);
        int title= getIntent().getIntExtra("title_id",0);
        txtView = (TextView) findViewById(R.id.textview);
        txtView.setMovementMethod(new ScrollingMovementMethod());
        txtView.setText(story[title]);

        //share the stuff
        btn=(Button)findViewById(R.id.share);
        btn.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                //TextView txtView = (TextView) findViewById(R.id.textview);
                //txtView.setTextSize(25);

                //String story = String.valueOf(parent.getItemAtPosition(position));
                int title = getIntent().getIntExtra("title_id", 0);
                txtView = (TextView) findViewById(R.id.textview);

                Intent sendIntent = new Intent();
                sendIntent.setAction(Intent.ACTION_SEND);
                sendIntent.putExtra(Intent.EXTRA_TEXT, story[title]+".\n"+"#bhagi");
                sendIntent.setType("text/plain");
                startActivity(sendIntent);

            }
        });

    }
}
