package com.example.bhagi.enjoy;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.view.View;
import android.widget.Button;
import android.widget.ListView;
import android.widget.TextView;

import java.util.ArrayList;
import static com.example.bhagi.enjoy.MotivationActivity.story;
public class MotivationActivity extends AppCompatActivity {
    Button btn;
    TextView txtView;
    public static String [] story={"जिन्दगी में बहुत सारे अवसर ऐसे आते है जब हम बुरे हालात का सामना कर रहे होते है और सोचते है कि क्या किया जा सकता है क्योंकि इतनी जल्दी तो सब कुछ बदलना संभव नहीं है और क्या पता मेरा ये छोटा सा बदलाव कुछ क्रांति लेकर आएगा या नहीं लेकिन मैं आपको बता दूँ हर चीज़ या बदलाव की शुरुआत बहुत ही basic ढंग से होती है | कई बार तो सफलता हमसे बस थोड़े ही कदम दूर होती है कि हम हार मान लेते है जबकि अपनी क्षमताओं पर भरोसा रख कर किया जाने वाला कोई भी बदलाव छोटा नहीं होता और वो हमारी जिन्दगी में एक नीव का पत्थर भी साबित हो सकता है | चलिए एक कहानी पढ़ते है इसके द्वारा समझने में आसानी होगी कि छोटा बदलाव किस कदर महत्वपूर्ण है |\n" +
            "\n" +
            "एक लड़का सुबह सुबह दौड़ने को जाया करता था | आते जाते वो एक बूढी महिला को देखता था | वो बूढी महिला तालाब के किनारे छोटे छोटे कछुवों की पीठ को साफ़ किया करती थी | एक दिन उसने इसके पीछे का कारण जानने की सोची |वो लड़का महिला के पास गया और उनका अभिवादन कर बोला ” नमस्ते आंटी ! मैं आपको हमेशा इन कछुवों की पीठ को साफ़ करते हुए देखता हूँ आप ऐसा किस वजह से करते हो ?”  महिला ने उस मासूम से लड़के को देखा और  इस पर लड़के को जवाब दिया ” मैं हर रविवार यंहा आती हूँ और इन छोटे छोटे कछुवों की पीठ साफ़ करते हुए सुख शांति का अनुभव लेती हूँ |”  क्योंकि इनकी पीठ पर जो कवच होता है उस पर कचता जमा हो जाने की वजह से इनकी गर्मी पैदा करने की क्षमता कम हो जाती है इसलिए ये कछुवे तैरने में मुश्किल का सामना करते है | कुछ समय बाद तक अगर ऐसा ही रहे तो ये कवच भी कमजोर हो जाते है इसलिए कवच को साफ़ करती हूँ |\n" +
            "\n" +
            "यह सुनकर लड़का बड़ा हैरान था | उसने फिर एक जाना पहचाना सा सवाल किया और बोला “बेशक आप बहुत अच्छा काम कर रहे है लेकिन फिर भी आंटी एक बात सोचिये कि इन जैसे कितने कछुवे है जो इनसे भी बुरी हालत में है जबकि आप सभी के लिए ये नहीं कर सकते तो उनका क्या क्योंकि आपके अकेले के बदलने से तो कोई बड़ा बदलाव नहीं आयेगा न |","एक व्यापारी था जिसके पास उसके अपने पांच ऊँट थे जिन पर सामान लादकर वो शहर शहर घूमता और कारोबार करता था और अपना व्यापार किया करता था | एक बार लौटते हुए रात हो गयी | तो वो रात को आराम करने के लिए एक सराय में रुका और और पेड़ोसे ऊँट को बाँधने की  तैयारी करने लगा | चार ऊँट तो बांध गये लेकिन पांचवे के लिए रस्सी कम पड़ गयी |\n" +
            "\n" +
            "उसने जब कोई उपाय और नहीं सूझा तो सराय में मालिक से सहायता मांगने की सोची वो सराय के अंदर जा ही रहा था कि उसे गेट के बाहर एक फ़कीर मिला जिसने व्यापारी से पुछा कि ‘तुम कुछ परेशान लग रहे हो बताओ क्या परेशानी है हो सकता है मैं तुम्हारी कुछ मदद कर पाऊं ‘ व्यापारी ने उसे अपनी समस्या बतलाई तो वो बड़े जोर जोर से हसा और फ़कीर ने कहा कि पांचवे ऊँट को भी ठीक उसी तरह बांध दो जिस तरीके से तुमने बाकि के ऊँटो को बांधा है | फकीर के ये कहने पर व्यापारी ने थोडा खीजकर और हैरान होकर कहा लेकिन ‘रस्सी है कन्हा ?” इस पर फ़कीर ने कहा उसे तुम कल्पना की रस्सी से बांधो | व्यापारी ने ऐसा ही किया और उसने ऊँट के गले में अभिनय करते हुए काल्पनिक रस्सी का फंदा डालने जैसा व्यवहार किया और उसका दूसरा सिरा पेड़ से बांध दिया | ऐसा करते ही ऊँट बड़े आराम से बैठ गया| व्यापारी चला गया सराय के अंदर और जाकर बड़े आराम से बेफिक्री की नींद सोया सुबह उठा और चलने की तयारी करी तो उसने बाकि के ऊँटो को खोला तो सारे ऊँट खड़े हो गये और चलने को तैयार हो गया लेकिन पांचवे ऊँट को हांकने के बाद भी वो खड़ा नहीं हुआ इस पर व्यापारी  गुस्से में आकर उसे मारने लगा लेकिन फिर भी ऊँट नहीं उठा इतने में कल वाला फ़कीर आया तो उसने कहा पागल इस बेजुबान को क्यों मार रहे हो अब | कल तुम ये बैठ नहीं रहा था तो परेशान थे और आज जब ये आराम से बैठा है तो भी तुमको परेशानी है इस पर व्यापारी ने कहा पर महाराज मुझे जाना है | फ़कीर ने कहा इसे खोलोगे तभी उठेगा न इस पर व्यापारी ने कहा मैंने कौनसा इसे बाँधा था मेने तो केवल बंधने का नाटक भर किया था तो फ़कीर कहने लगा जैसे कल तुमने इसे बाँधने का नाटक किया था वैसे ही अब खोलने केलिए भी नाटक करो | व्यापारी ने ऐसी ही किया और पलभर में ऊंट खड़ा हो गया |\n" +
            "\n" +
            "अब फ़कीर ने पते की बात बोली कि जिस तरह ये ऊंट अदृश्य रस्सियों से बंधा है उसी तरह लोग भी पुरानी रुढियों से बंधे है और आगे बढ़ना नहीं चाहते है जबकि परिवर्तन प्रकृति का नियम है और इसलिए हमे रुढियों के विषय में ना सोचकर अपनी और अपने अपनों की खुशियों के बारे में सोचकर कभी कभी जिन्दगी के कुछ ऐसे नियम जो हमने नहीं बनाये है और उनके होने का औचित्य नहीं है उनके लिए थोडा soft corner रखना चाहिए जैसे कि प्रेम विवाह और विधवा विवाह जैसे मुद्दों पर कठोर नहीं होकर कोमलता से पेश आना चाहिए | जबकि अगर थोड़े libral होते है चीजों के प्रति तो हम अपने साथ साथ दूसरो के लिए भी खुशियों के रास्ते खोलते है |","एक समय शराब का एक व्यसनी एक संत के पास गया और विनम्र स्वर में बोला, 'गुरूदेव, मैं इस शराब के व्यसन से बहुत ही दुखी हो गया हूँ। इसकी वजह से मेरा घर बरबाद हो रहा है। मेरे बच्चे भूखे मर रहे हैं, किन्तु मैं शराब के बगैर नही रह पाता! मेरे घर की शांति नष्ट हो गयी है। कृपया आप मुझे कोई सरल उपाय बताएँ, जिससे मैं अपने घर की शांति फिर से पा सकूँ।' गुरूदेव ने कहा, 'जब इस व्यसन से तुमको इतना नुकसान होता है, तो तुम इसे छोड़ क्यों नहीं देते?' व्यक्ति बोला, 'पूज्यश्री, मैं शराब को छोड़ना चाहता हूं, पर यह ही मेरे खून में इस कदर समा गयी है कि मुझे छोड़ने का नाम ही नहीं ले रही है।'\n" +
            "\n" +
            "गुरूदेव ने हँस कर कहा, 'कल तुम फिर आना! मैं तुम्हें बता दूँगा कि शराब कैसे छोड़नी है?'\n" +
            "\n" +
            "दूसरे दिन निश्चित समय पर वह व्यक्ति महात्मा के पास गया। उसे देख महात्मा झट से खड़े हुए और एक खम्भे को कस कर पकड़ लिया। जब उस व्यक्ति ने महात्मा को इस दशा में देखा, तो कुछ समय तो वह मौन खड़ा रहा, पर जब काफी देर बाद भी महात्माजी ने खम्भे को नहीं छोड़ा, तो उससे रहा नहीं गया और पूछ बैठा, कि 'गुरूदेव, आपने व्यर्थ इस खम्भे को क्यों पकड़ रखा है?' गुरूदेव बोले, 'वत्स! मैंने इस खम्भे को नहीं पकड़ा है, यह खम्भा मेरे शरीर को पकड़े हुए है। मैं चाहता हूँ कि यह मुझे छोड़ दे, किन्तु यह तो मुझे छोड़ ही नहीं रहा है।' उस व्यक्ति को अचम्भा हुआ! व्ह बोला, 'गुरूदेव मैं शराब जरूर पीता हूँ, मगर मूर्ख नहीं हूँ। आपने ही जानबूझ कर इस खम्भे को कस कर पकड़ रखा है। यह तो निर्जिव है, यह आपको क्या पकड़ेगी यदि आप दृढ़-संकल्प कर लें, तो इसी वक्त इसको छोड़ सकते हैं। गुरूदेव बोले, 'नादान मनुष्य, यही बात तो मैं तुम्हें समझाना चाहता हूँ कि जिस तरह मुझे खम्भे ने नहीं बल्कि मैंने ही उसे पकड़ रखा था, उसी तरह इस शराब ने तुम्हें नहीं पकड़ा है, बल्कि सच तो यह है कि तुमने ही शराब को पकड़ रखा है। तुम कह रहे थे कि यह शराब मुझे नहीं छोड़ रही है। जबकि सत्य यह है कि तुम अपने मन में यह दृढ़ निश्चय कर लो कि मुझे इस व्यसन का त्याग अभी कर देना है, तो इसी वक्त तुम्हारी शराब पीने की आदत छूट जायेगी। शरीर की हर क्रिया मन के द्वारा नियंत्रित होती है और और मन में जैसी इच्छा-शक्ति प्रबल होती है, वैसा ही कार्य सफल होता है।' वह शराबी गुरू के इस अमृत-वचनों से इतना प्रभावित हुआ कि उसने उसी वक्त भविष्य में कभी शराब न पीने का दृढ़-संकलप किया। उसके घर में खुशियाँ लौट आयीं और वह शांति से जीवन-यापन करने लगा।\n" +
            "\n" +
            "इस तरह हमें शिक्षा मिलती है कि जीवन में कोई भी व्यसन ऐसा नहीं है, जिसे एक बार ग्रहण किये जाने के बाद छोड़ा ना जा सके। अगर मनुष्य चाहे तो बड़ी से बड़ी बुराई का त्याग कर सकता है।\n"};


    @Override
    protected void onCreate (Bundle savedInstanceState){
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_jocks);
        int title = getIntent().getIntExtra("title_id", 0);
        txtView = (TextView) findViewById(R.id.textview);
        txtView.setMovementMethod(new ScrollingMovementMethod());
        txtView.setText(story[title]);

        btn=(Button)findViewById(R.id.share);
        btn.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                //TextView txtView = (TextView) findViewById(R.id.textview);
                //txtView.setTextSize(25);

                //String story = String.valueOf(parent.getItemAtPosition(position));
                int title = getIntent().getIntExtra("title_id", 0);
                txtView = (TextView) findViewById(R.id.textview);

                Intent sendIntent = new Intent();
                sendIntent.setAction(Intent.ACTION_SEND);
                sendIntent.putExtra(Intent.EXTRA_TEXT, story[title]+".\n"+"#bhagi");
                sendIntent.setType("text/plain");
                startActivity(sendIntent);

            }
        });


    }
}

